microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51N20A.atdf
        <register name="APBAMASK" offset="0x14" rw="RW" size="4" initval="0x000007FF" caption="APBA Mask">
          <bitfield name="PAC_" caption="PAC APB Clock Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Clock Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Clock Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Clock Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Clock Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Clock Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM APB Clock Enable" mask="0x800"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x1000"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x2000"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x4000"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x8000"/>
        </register>
        <register name="APBBMASK" offset="0x18" rw="RW" size="4" initval="0x00018056" caption="APBB Mask">
          <bitfield name="USB_" caption="USB APB Clock Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Clock Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Clock Enable" mask="0x4"/>
          <bitfield name="PORT_" caption="PORT APB Clock Enable" mask="0x10"/>
          <bitfield name="HMATRIX_" caption="HMATRIX APB Clock Enable" mask="0x40"/>
          <bitfield name="EVSYS_" caption="EVSYS APB Clock Enable" mask="0x80"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Clock Enable" mask="0x200"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Clock Enable" mask="0x400"/>
          <bitfield name="TCC0_" caption="TCC0 APB Clock Enable" mask="0x800"/>
          <bitfield name="TCC1_" caption="TCC1 APB Clock Enable" mask="0x1000"/>
          <bitfield name="TC2_" caption="TC2 APB Clock Enable" mask="0x2000"/>
          <bitfield name="TC3_" caption="TC3 APB Clock Enable" mask="0x4000"/>
          <bitfield name="TAL_" caption="TAL APB Clock Enable" mask="0x8000"/>
          <bitfield name="RAMECC_" caption="RAMECC APB Clock Enable" mask="0x10000"/>
        </register>
        <register name="APBCMASK" offset="0x1C" rw="RW" size="4" initval="0x00002000" caption="APBC Mask">
          <bitfield name="TCC2_" caption="TCC2 APB Clock Enable" mask="0x8"/>
          <bitfield name="TCC3_" caption="TCC3 APB Clock Enable" mask="0x10"/>
          <bitfield name="TC4_" caption="TC4 APB Clock Enable" mask="0x20"/>
          <bitfield name="TC5_" caption="TC5 APB Clock Enable" mask="0x40"/>
          <bitfield name="PDEC_" caption="PDEC APB Clock Enable" mask="0x80"/>
          <bitfield name="AC_" caption="AC APB Clock Enable" mask="0x100"/>
          <bitfield name="AES_" caption="AES APB Clock Enable" mask="0x200"/>
          <bitfield name="TRNG_" caption="TRNG APB Clock Enable" mask="0x400"/>
          <bitfield name="ICM_" caption="ICM APB Clock Enable" mask="0x800"/>
          <bitfield name="QSPI_" caption="QSPI APB Clock Enable" mask="0x2000"/>
          <bitfield name="CCL_" caption="CCL APB Clock Enable" mask="0x4000"/>
        </register>
        <register name="APBDMASK" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="APBD Mask">
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Clock Enable" mask="0x2"/>
          <bitfield name="SERCOM6_" caption="SERCOM6 APB Clock Enable" mask="0x4"/>
          <bitfield name="SERCOM7_" caption="SERCOM7 APB Clock Enable" mask="0x8"/>
          <bitfield name="TCC4_" caption="TCC4 APB Clock Enable" mask="0x10"/>
          <bitfield name="TC6_" caption="TC6 APB Clock Enable" mask="0x20"/>
          <bitfield name="TC7_" caption="TC7 APB Clock Enable" mask="0x40"/>
          <bitfield name="ADC0_" caption="ADC0 APB Clock Enable" mask="0x80"/>
          <bitfield name="ADC1_" caption="ADC1 APB Clock Enable" mask="0x100"/>
          <bitfield name="DAC_" caption="DAC APB Clock Enable" mask="0x200"/>
          <bitfield name="I2S_" caption="I2S APB Clock Enable" mask="0x400"/>
          <bitfield name="PCC_" caption="PCC APB Clock Enable" mask="0x800"/>
        </register>
      </register-group>
      <value-group name="MCLK_HSDIV__DIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
      </value-group>
      <value-group name="MCLK_CPUDIV__DIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
    <module name="NVMCTRL" id="U2409" version="1.0.0" caption="Non-Volatile Memory Controller">
      <register-group name="NVMCTRL" caption="Non-Volatile Memory Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="2" initval="0x0004" caption="Control A">
          <bitfield name="AUTOWS" caption="Auto Wait State Enable" mask="0x4"/>
          <bitfield name="SUSPEN" caption="Suspend Enable" mask="0x8"/>
          <bitfield name="WMODE" caption="Write Mode" mask="0x30" values="NVMCTRL_CTRLA__WMODE"/>
          <bitfield name="PRM" caption="Power Reduction Mode during Sleep" mask="0xC0" values="NVMCTRL_CTRLA__PRM"/>
          <bitfield name="RWS" caption="NVM Read Wait States" mask="0xF00"/>
          <bitfield name="AHBNS0" caption="Force AHB0 access to NONSEQ, burst transfers are continuously rearbitrated" mask="0x1000"/>
          <bitfield name="AHBNS1" caption="Force AHB1 access to NONSEQ, burst transfers are continuously rearbitrated" mask="0x2000"/>
          <bitfield name="CACHEDIS0" caption="AHB0 Cache Disable" mask="0x4000"/>
          <bitfield name="CACHEDIS1" caption="AHB1 Cache Disable" mask="0x8000"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="W" size="2" initval="0x0000" caption="Control B">
          <bitfield name="CMD" caption="Command" mask="0x7F" values="NVMCTRL_CTRLB__CMD"/>
          <bitfield name="CMDEX" caption="Command Execution" mask="0xFF00" values="NVMCTRL_CTRLB__CMDEX"/>
        </register>
        <register name="PARAM" offset="0x8" rw="R" size="4" initval="0x00060000" caption="NVM Parameter">
          <bitfield name="NVMP" caption="NVM Pages" mask="0xFFFF"/>
          <bitfield name="PSZ" caption="Page Size" mask="0x70000" values="NVMCTRL_PARAM__PSZ"/>
          <bitfield name="SEE" caption="SmartEEPROM Supported" mask="0x80000000"/>
        </register>
