microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51N20A.atdf
      <value-group name="SDHC_MCCAR__MAXCUR30V">
        <value name="OTHER" caption="Get information via another method" value="0"/>
        <value name="4MA" caption="4mA" value="1"/>
        <value name="8MA" caption="8mA" value="2"/>
        <value name="12MA" caption="12mA" value="3"/>
      </value-group>
      <value-group name="SDHC_MCCAR__MAXCUR33V">
        <value name="OTHER" caption="Get information via another method" value="0"/>
        <value name="4MA" caption="4mA" value="1"/>
        <value name="8MA" caption="8mA" value="2"/>
        <value name="12MA" caption="12mA" value="3"/>
      </value-group>
      <value-group name="SDHC_FERACES__ACMDCRC">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FERACES__ACMDEND">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FERACES__ACMDIDX">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FERACES__ACMDTEO">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FERACES__ACMD12NE">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FERACES__CMDNI">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FEREIS__ACMD">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FEREIS__ADMA">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FEREIS__BOOTAE">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FEREIS__CMDCRC">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FEREIS__CMDEND">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FEREIS__CMDIDX">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FEREIS__CMDTEO">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FEREIS__CURLIM">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FEREIS__DATCRC">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FEREIS__DATEND">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_FEREIS__DATTEO">
        <value name="NO" caption="No Interrupt" value="0"/>
        <value name="YES" caption="Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_AESR__ERRST">
        <value name="STOP" caption="ST_STOP (Stop DMA)" value="0"/>
        <value name="FDS" caption="ST_FDS (Fetch Descriptor)" value="1"/>
        <value name="TFR" caption="ST_TFR (Transfer Data)" value="3"/>
      </value-group>
      <value-group name="SDHC_AESR__LMIS">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_PVR__CLKGSEL">
        <value name="DIV" caption="Host Controller Ver2.00 Compatible Clock Generator (Divider)" value="0"/>
        <value name="PROG" caption="Programmable Clock Generator" value="1"/>
      </value-group>
      <value-group name="SDHC_PVR__DRVSEL">
        <value name="B" caption="Driver Type B is Selected" value="0"/>
        <value name="A" caption="Driver Type A is Selected" value="1"/>
        <value name="C" caption="Driver Type C is Selected" value="2"/>
        <value name="D" caption="Driver Type D is Selected" value="3"/>
      </value-group>
      <value-group name="SDHC_MC1R__CMDTYP">
        <value name="NORMAL" caption="Not a MMC specific command" value="0"/>
        <value name="WAITIRQ" caption="Wait IRQ Command" value="1"/>
        <value name="STREAM" caption="Stream Command" value="2"/>
        <value name="BOOT" caption="Boot Command" value="3"/>
      </value-group>
      <value-group name="SDHC_ACR__BMAX">
        <value name="INCR16" value="0"/>
        <value name="INCR8" value="1"/>
        <value name="INCR4" value="2"/>
        <value name="SINGLE" value="3"/>
      </value-group>
      <value-group name="SDHC_CC2R__FSDCLKD">
        <value name="NOEFFECT" caption="No effect" value="0"/>
        <value name="DISABLE" caption="SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled" value="1"/>
      </value-group>
      <value-group name="SDHC_DBGR__NIDBG">
        <value name="IDBG" caption="Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer)" value="0"/>
        <value name="NIDBG" caption="Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer)" value="1"/>
      </value-group>
    </module>
    <module name="SERCOM" id="U2201" version="5.0.0" caption="Serial Communication Interface">
      <register-group class="union" union-tag="SERCOM.I2CM_CTRLA.MODE" name="SERCOM" caption="Serial Communication Interface">
        <register-group name="I2CM" name-in-module="SERCOM_I2CM" union-tag-value="5" offset="0"/>
        <register-group name="I2CS" name-in-module="SERCOM_I2CS" union-tag-value="4" offset="0"/>
