microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51N20A.atdf
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="BRK" caption="Break Interrupt Enable" mask="0x1"/>
          <bitfield name="IPS0" caption="Inter-Processor Signal Interrupt Enable for CPU 0" mask="0x2"/>
          <bitfield name="IPS1" caption="Inter-Processor Signal Interrupt Enable for CPU 1" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="BRK" caption="Break Interrupt Enable" mask="0x1"/>
          <bitfield name="IPS0" caption="Inter-Processor Signal Interrupt Enable for CPU 0" mask="0x2"/>
          <bitfield name="IPS1" caption="Inter-Processor Signal Interrupt Enable for CPU 1" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="BRK" caption="Break" mask="0x1"/>
          <bitfield name="IPS0" caption="Inter-Processor Signal for CPU 0" mask="0x2"/>
          <bitfield name="IPS1" caption="Inter-Processor Signal for CPU 1" mask="0x4"/>
        </register>
        <register name="GLOBMASK" offset="0xB" rw="RW" size="1" initval="0x00" caption="Global Break Requests Mask">
          <bitfield name="CPU0" caption="CPU 0 Break Master" mask="0x1"/>
          <bitfield name="CPU1" caption="CPU 1 Break Master" mask="0x2"/>
          <bitfield name="EVBRK" caption="Event Break Master" mask="0x40"/>
          <bitfield name="EXTBRK" caption="External Break Master" mask="0x80"/>
        </register>
        <register name="HALT" offset="0xC" rw="W" size="1" initval="0x00" caption="Debug Halt Request">
          <bitfield name="CPU0" caption="CPU 0 Break Master" mask="0x1"/>
          <bitfield name="CPU1" caption="CPU 1 Break Master" mask="0x2"/>
          <bitfield name="EVBRK" caption="Event Break Master" mask="0x40"/>
          <bitfield name="EXTBRK" caption="External Break Master" mask="0x80"/>
        </register>
        <register name="RESTART" offset="0xD" rw="W" size="1" initval="0x00" caption="Debug Restart Request">
          <bitfield name="CPU0" caption="CPU 0 Break Master" mask="0x1"/>
          <bitfield name="CPU1" caption="CPU 1 Break Master" mask="0x2"/>
          <bitfield name="EXTBRK" caption="External Break Master" mask="0x80"/>
        </register>
        <register name="BRKSTATUS" offset="0xE" rw="R" size="2" initval="0x0000" caption="Break Request Status">
          <bitfield name="CPU0" caption="CPU 0 Break Request" mask="0x3"/>
          <bitfield name="CPU1" caption="CPU 1 Break Request" mask="0xC"/>
          <bitfield name="EVBRK" caption="Event Break Request" mask="0x3000"/>
          <bitfield name="EXTBRK" caption="External Break Request" mask="0xC000"/>
        </register>
        <register-group name="CTIS" name-in-module="CTIS" offset="0x010" count="4"/>
        <register name="INTSTATUS" offset="0x20" rw="R" size="1" count="137" initval="0x00" caption="Interrupt n Status">
          <bitfield name="IRQ0" caption="Interrupt Status for Interrupt Request 0 within Interrupt n" mask="0x1"/>
          <bitfield name="IRQ1" caption="Interrupt Status for Interrupt Request 1 within Interrupt n" mask="0x2"/>
          <bitfield name="IRQ2" caption="Interrupt Status for Interrupt Request 2 within Interrupt n" mask="0x4"/>
          <bitfield name="IRQ3" caption="Interrupt Status for Interrupt Request 3 within Interrupt n" mask="0x8"/>
          <bitfield name="IRQ4" caption="Interrupt Status for Interrupt Request 4 within Interrupt n" mask="0x10"/>
          <bitfield name="IRQ5" caption="Interrupt Status for Interrupt Request 5 within Interrupt n" mask="0x20"/>
          <bitfield name="IRQ6" caption="Interrupt Status for Interrupt Request 6 within Interrupt n" mask="0x40"/>
          <bitfield name="IRQ7" caption="Interrupt Status for Interrupt Request 7 within Interrupt n" mask="0x80"/>
        </register>
        <register name="DMACPUSEL0" offset="0x110" rw="RW" size="4" initval="0x00000000" caption="DMA Channel Interrupts CPU Select 0">
          <bitfield name="CH0" caption="DMA Channel 0 Interrupt CPU Select" mask="0x1"/>
          <bitfield name="CH1" caption="DMA Channel 1 Interrupt CPU Select" mask="0x4"/>
          <bitfield name="CH2" caption="DMA Channel 2 Interrupt CPU Select" mask="0x10"/>
          <bitfield name="CH3" caption="DMA Channel 3 Interrupt CPU Select" mask="0x40"/>
          <bitfield name="CH4" caption="DMA Channel 4 Interrupt CPU Select" mask="0x100"/>
          <bitfield name="CH5" caption="DMA Channel 5 Interrupt CPU Select" mask="0x400"/>
          <bitfield name="CH6" caption="DMA Channel 6 Interrupt CPU Select" mask="0x1000"/>
          <bitfield name="CH7" caption="DMA Channel 7 Interrupt CPU Select" mask="0x4000"/>
          <bitfield name="CH8" caption="DMA Channel 8 Interrupt CPU Select" mask="0x10000"/>
          <bitfield name="CH9" caption="DMA Channel 9 Interrupt CPU Select" mask="0x40000"/>
          <bitfield name="CH10" caption="DMA Channel 10 Interrupt CPU Select" mask="0x100000"/>
          <bitfield name="CH11" caption="DMA Channel 11 Interrupt CPU Select" mask="0x400000"/>
          <bitfield name="CH12" caption="DMA Channel 12 Interrupt CPU Select" mask="0x1000000"/>
          <bitfield name="CH13" caption="DMA Channel 13 Interrupt CPU Select" mask="0x4000000"/>
          <bitfield name="CH14" caption="DMA Channel 14 Interrupt CPU Select" mask="0x10000000"/>
          <bitfield name="CH15" caption="DMA Channel 15 Interrupt CPU Select" mask="0x40000000"/>
        </register>
        <register name="DMACPUSEL1" offset="0x114" rw="RW" size="4" initval="0x00000000" caption="DMA Channel Interrupts CPU Select 1">
          <bitfield name="CH16" caption="DMA Channel 16 Interrupt CPU Select" mask="0x1"/>
          <bitfield name="CH17" caption="DMA Channel 17 Interrupt CPU Select" mask="0x4"/>
          <bitfield name="CH18" caption="DMA Channel 18 Interrupt CPU Select" mask="0x10"/>
          <bitfield name="CH19" caption="DMA Channel 19 Interrupt CPU Select" mask="0x40"/>
          <bitfield name="CH20" caption="DMA Channel 20 Interrupt CPU Select" mask="0x100"/>
          <bitfield name="CH21" caption="DMA Channel 21 Interrupt CPU Select" mask="0x400"/>
          <bitfield name="CH22" caption="DMA Channel 22 Interrupt CPU Select" mask="0x1000"/>
          <bitfield name="CH23" caption="DMA Channel 23 Interrupt CPU Select" mask="0x4000"/>
          <bitfield name="CH24" caption="DMA Channel 24 Interrupt CPU Select" mask="0x10000"/>
          <bitfield name="CH25" caption="DMA Channel 25 Interrupt CPU Select" mask="0x40000"/>
          <bitfield name="CH26" caption="DMA Channel 26 Interrupt CPU Select" mask="0x100000"/>
          <bitfield name="CH27" caption="DMA Channel 27 Interrupt CPU Select" mask="0x400000"/>
          <bitfield name="CH28" caption="DMA Channel 28 Interrupt CPU Select" mask="0x1000000"/>
          <bitfield name="CH29" caption="DMA Channel 29 Interrupt CPU Select" mask="0x4000000"/>
          <bitfield name="CH30" caption="DMA Channel 30 Interrupt CPU Select" mask="0x10000000"/>
          <bitfield name="CH31" caption="DMA Channel 31 Interrupt CPU Select" mask="0x40000000"/>
        </register>
        <register name="EVCPUSEL0" offset="0x118" rw="RW" size="4" initval="0x00000000" caption="EVSYS Channel Interrupts CPU Select 0">
          <bitfield name="CH0" caption="Event Channel 0 Interrupt CPU Select" mask="0x1"/>
          <bitfield name="CH1" caption="Event Channel 1 Interrupt CPU Select" mask="0x4"/>
          <bitfield name="CH2" caption="Event Channel 2 Interrupt CPU Select" mask="0x10"/>
          <bitfield name="CH3" caption="Event Channel 3 Interrupt CPU Select" mask="0x40"/>
          <bitfield name="CH4" caption="Event Channel 4 Interrupt CPU Select" mask="0x100"/>
          <bitfield name="CH5" caption="Event Channel 5 Interrupt CPU Select" mask="0x400"/>
          <bitfield name="CH6" caption="Event Channel 6 Interrupt CPU Select" mask="0x1000"/>
          <bitfield name="CH7" caption="Event Channel 7 Interrupt CPU Select" mask="0x4000"/>
          <bitfield name="CH8" caption="Event Channel 8 Interrupt CPU Select" mask="0x10000"/>
          <bitfield name="CH9" caption="Event Channel 9 Interrupt CPU Select" mask="0x40000"/>
          <bitfield name="CH10" caption="Event Channel 10 Interrupt CPU Select" mask="0x100000"/>
          <bitfield name="CH11" caption="Event Channel 11 Interrupt CPU Select" mask="0x400000"/>
        </register>
