microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51N20A.atdf
        <register name="INTCPUSEL6" offset="0x140" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 6">
          <bitfield name="SERCOM4" caption="SERCOM4 Interrupt CPU Select" mask="0x1"/>
          <bitfield name="SERCOM5" caption="SERCOM5 Interrupt CPU Select" mask="0x4"/>
          <bitfield name="SERCOM6" caption="SERCOM6 Interrupt CPU Select" mask="0x10"/>
          <bitfield name="SERCOM7" caption="SERCOM7 Interrupt CPU Select" mask="0x40"/>
          <bitfield name="TCC4" caption="TCC4 Interrupt CPU Select" mask="0x100"/>
          <bitfield name="TC6" caption="TC6 Interrupt CPU Select" mask="0x400"/>
          <bitfield name="TC7" caption="TC7 Interrupt CPU Select" mask="0x1000"/>
          <bitfield name="ADC0" caption="ADC0 Interrupt CPU Select" mask="0x4000"/>
          <bitfield name="ADC1" caption="ADC1 Interrupt CPU Select" mask="0x10000"/>
          <bitfield name="DAC" caption="DAC Interrupt CPU Select" mask="0x40000"/>
          <bitfield name="I2S" caption="I2S Interrupt CPU Select" mask="0x100000"/>
          <bitfield name="PCC" caption="PCC Interrupt CPU Select" mask="0x400000"/>
        </register>
        <register name="INTCPUSEL7" offset="0x144" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 7">
        </register>
        <register name="INTCPUSEL8" offset="0x148" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 8">
          <bitfield name="SDHC0" caption="SDHC0 Interrupt CPU Select" mask="0x1"/>
          <bitfield name="SDHC1" caption="SDHC1 Interrupt CPU Select" mask="0x4"/>
        </register>
        <register name="IRQTRIG" offset="0x164" rw="RW" size="4" initval="0x00000000" caption="Interrupt Trigger">
          <bitfield name="ENABLE" caption="Trigger Enable" mask="0x1"/>
          <bitfield name="IRQNUM" caption="Interrupt Request Number" mask="0xFF00"/>
          <bitfield name="OVERRIDE" caption="Interrupt Request Override Value" mask="0xFF0000"/>
        </register>
        <register name="IRQMON" offset="0x168" rw="RW" size="2" count="1" initval="0x0000" caption="Interrupt Monitor Select">
          <bitfield name="EXTEND" caption="Extended Interrupt Request" mask="0x1" values="TAL_IRQMON__EXTEND"/>
          <bitfield name="DROP" caption="Drop Shortened Events" mask="0x2"/>
          <bitfield name="CPUID" caption="ID of CPU currently servicing this IRQ" mask="0x4"/>
          <bitfield name="IRQNUM" caption="Interrupt Request Number" mask="0xFF00"/>
        </register>
        <register-group name="CPUIRQS" name-in-module="CPUIRQS" offset="0x180" count="2"/>
        <register-group name="SMASKS" name-in-module="SMASKS" offset="0x200" count="2"/>
        <register name="SFLAGCLR" offset="0x220" rw="W" size="4" atomic-op="clear:SFLAG" count="2" initval="0x00000000" caption="Inter-Process Signal Flag Clear">
          <bitfield name="IPS0" caption="Inter-Process Signal 0" mask="0x1"/>
          <bitfield name="IPS1" caption="Inter-Process Signal 1" mask="0x2"/>
          <bitfield name="IPS2" caption="Inter-Process Signal 2" mask="0x4"/>
          <bitfield name="IPS3" caption="Inter-Process Signal 3" mask="0x8"/>
          <bitfield name="IPS4" caption="Inter-Process Signal 4" mask="0x10"/>
          <bitfield name="IPS5" caption="Inter-Process Signal 5" mask="0x20"/>
          <bitfield name="IPS6" caption="Inter-Process Signal 6" mask="0x40"/>
          <bitfield name="IPS7" caption="Inter-Process Signal 7" mask="0x80"/>
          <bitfield name="IPS8" caption="Inter-Process Signal 8" mask="0x100"/>
          <bitfield name="IPS9" caption="Inter-Process Signal 9" mask="0x200"/>
          <bitfield name="IPS10" caption="Inter-Process Signal 10" mask="0x400"/>
          <bitfield name="IPS11" caption="Inter-Process Signal 11" mask="0x800"/>
          <bitfield name="IPS12" caption="Inter-Process Signal 12" mask="0x1000"/>
          <bitfield name="IPS13" caption="Inter-Process Signal 13" mask="0x2000"/>
          <bitfield name="IPS14" caption="Inter-Process Signal 14" mask="0x4000"/>
          <bitfield name="IPS15" caption="Inter-Process Signal 15" mask="0x8000"/>
          <bitfield name="IPS16" caption="Inter-Process Signal 16" mask="0x10000"/>
          <bitfield name="IPS17" caption="Inter-Process Signal 17" mask="0x20000"/>
          <bitfield name="IPS18" caption="Inter-Process Signal 18" mask="0x40000"/>
          <bitfield name="IPS19" caption="Inter-Process Signal 19" mask="0x80000"/>
          <bitfield name="IPS20" caption="Inter-Process Signal 20" mask="0x100000"/>
          <bitfield name="IPS21" caption="Inter-Process Signal 21" mask="0x200000"/>
          <bitfield name="IPS22" caption="Inter-Process Signal 22" mask="0x400000"/>
          <bitfield name="IPS23" caption="Inter-Process Signal 23" mask="0x800000"/>
          <bitfield name="IPS24" caption="Inter-Process Signal 24" mask="0x1000000"/>
          <bitfield name="IPS25" caption="Inter-Process Signal 25" mask="0x2000000"/>
          <bitfield name="IPS26" caption="Inter-Process Signal 26" mask="0x4000000"/>
          <bitfield name="IPS27" caption="Inter-Process Signal 27" mask="0x8000000"/>
          <bitfield name="IPS28" caption="Inter-Process Signal 28" mask="0x10000000"/>
          <bitfield name="IPS29" caption="Inter-Process Signal 29" mask="0x20000000"/>
          <bitfield name="IPS30" caption="Inter-Process Signal 30" mask="0x40000000"/>
          <bitfield name="IPS31" caption="Inter-Process Signal 31" mask="0x80000000"/>
        </register>
        <register name="SFLAGSET" offset="0x228" rw="W" size="4" atomic-op="set:SFLAG" count="2" initval="0x00000000" caption="Inter-Process Signal Flag Set">
          <bitfield name="IPS0" caption="Inter-Process Signal 0" mask="0x1"/>
          <bitfield name="IPS1" caption="Inter-Process Signal 1" mask="0x2"/>
          <bitfield name="IPS2" caption="Inter-Process Signal 2" mask="0x4"/>
          <bitfield name="IPS3" caption="Inter-Process Signal 3" mask="0x8"/>
          <bitfield name="IPS4" caption="Inter-Process Signal 4" mask="0x10"/>
          <bitfield name="IPS5" caption="Inter-Process Signal 5" mask="0x20"/>
          <bitfield name="IPS6" caption="Inter-Process Signal 6" mask="0x40"/>
          <bitfield name="IPS7" caption="Inter-Process Signal 7" mask="0x80"/>
          <bitfield name="IPS8" caption="Inter-Process Signal 8" mask="0x100"/>
          <bitfield name="IPS9" caption="Inter-Process Signal 9" mask="0x200"/>
          <bitfield name="IPS10" caption="Inter-Process Signal 10" mask="0x400"/>
          <bitfield name="IPS11" caption="Inter-Process Signal 11" mask="0x800"/>
          <bitfield name="IPS12" caption="Inter-Process Signal 12" mask="0x1000"/>
          <bitfield name="IPS13" caption="Inter-Process Signal 13" mask="0x2000"/>
          <bitfield name="IPS14" caption="Inter-Process Signal 14" mask="0x4000"/>
          <bitfield name="IPS15" caption="Inter-Process Signal 15" mask="0x8000"/>
          <bitfield name="IPS16" caption="Inter-Process Signal 16" mask="0x10000"/>
          <bitfield name="IPS17" caption="Inter-Process Signal 17" mask="0x20000"/>
          <bitfield name="IPS18" caption="Inter-Process Signal 18" mask="0x40000"/>
          <bitfield name="IPS19" caption="Inter-Process Signal 19" mask="0x80000"/>
          <bitfield name="IPS20" caption="Inter-Process Signal 20" mask="0x100000"/>
          <bitfield name="IPS21" caption="Inter-Process Signal 21" mask="0x200000"/>
          <bitfield name="IPS22" caption="Inter-Process Signal 22" mask="0x400000"/>
          <bitfield name="IPS23" caption="Inter-Process Signal 23" mask="0x800000"/>
          <bitfield name="IPS24" caption="Inter-Process Signal 24" mask="0x1000000"/>
          <bitfield name="IPS25" caption="Inter-Process Signal 25" mask="0x2000000"/>
          <bitfield name="IPS26" caption="Inter-Process Signal 26" mask="0x4000000"/>
          <bitfield name="IPS27" caption="Inter-Process Signal 27" mask="0x8000000"/>
          <bitfield name="IPS28" caption="Inter-Process Signal 28" mask="0x10000000"/>
          <bitfield name="IPS29" caption="Inter-Process Signal 29" mask="0x20000000"/>
          <bitfield name="IPS30" caption="Inter-Process Signal 30" mask="0x40000000"/>
          <bitfield name="IPS31" caption="Inter-Process Signal 31" mask="0x80000000"/>
        </register>
